# Itogovaya-
## Итоги блока. Выбор специализации

### Задача: 
Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равна 3 символа. 
Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, 
лучше обойтись исключительно массивами.
Примеры:["hello", "2", "world", "-)"]-> ["2", "-)"]

### Решение:

using System;
using System.Linq;

class Program
{
    static void Main(string[] args)
    {
        // Выводим сообщение о необходимости определить размер входного массива
        Console.Write("Введите количество элементов массива: ");
        // Объявляем и заполняем переменную, отвечающую за размер входного массива из ввода
        int size = Convert.ToInt32(Console.ReadLine());
        // Объявляем входной массив
        string[] array = new string[size];
        // Заполняем входной массив через цикл
        for (int i = 0; i < size; i++)
        {
            // Выводим сообщение о необходимости заполнить строку
            Console.Write($"Введите строку {i + 1} из {size}: ");
            // Записываем значение в массив из ввода
            array[i] = Console.ReadLine();
        }
        // Вызываем метод печатающий результат на вход передаем ему результат работы метода, находящего короткие строки в входном массиве
        PrintArray(ShortArray(array));
    }


// Метод получающий массив на вход и возвращающий массив только со строками не длиннее 3-х символов
    static string[] ShortArray(string[] array)
    {
        // Объявляем результирующий массив размер с входящий
        string[] array_final = new string[array.GetLength(0)];
        // Объявляем переменную счетчик найденных коротких строк
        int j = 0;
        // Перебираем входной массив
        for (int i = 0; i < array.GetLength(0); i++)
        {
            // Ищем есть ли строки не длиннее 3-х символов
            if (array[i].Length <= 3)
            {
                // Заполняем результирующий массив
                array_final[j] = array[i];
                // Увеличиваем на 1 переменную счетчик найденных коротких строк
                j++;
            }
        }
        // Пересоздаем результирующий массив удалив пустые элементы
        array_final = array_final.Where(x => !string.IsNullOrEmpty(x)).ToArray();
        // Возвращаем результирующий массив
        return array_final;
    }
    // Метод получающий массив на вход и выводящий его в консоль с нужным форматированием
    static void PrintArray(string[] array)
    {
        // Выводим открывающую квадратную скобку
        Console.Write("[");
        // Выводим элементы массива с разделителем ","
        Console.Write(String.Join(",", array));
        // Выводим закрывающую квадратную скобку
        Console.Write("]");
    }
}
